Revit 2027 API
MEPSection.TotalCurveLength Property
 The total length of all segments in the section.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double TotalCurveLength { get; }
Public ReadOnly Property TotalCurveLength As Double
	Get
public:
property double TotalCurveLength {
	double get ();
}
member TotalCurveLength : float with get
Property Value
Double
Remarks
 Default unit is Decimal feet. The unit type is UT_Length.
See Also
Reference
MEPSection Class
Autodesk.Revit.DB.Mechanical Namespace